1yib.rust-bundle
andenetalexander.vim-cheatsheet
charliermarsh.ruff
docker.docker
dustypomerleau.rust-syntax
fill-labs.dependi
github.copilot
github.copilot-chat
github.github-vscode-theme
luke-zhang-04.processing-vscode
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
ms-windows-ai-studio.windows-ai-studio
octref.vetur
ritwickdey.liveserver
rust-lang.rust-analyzer
tamasfe.even-better-toml
tobiah.language-pde
twxs.cmake
vscodevim.vim